app/Models/PanelModel.php

DELETE FROM `tanrilar`
WHERE `id` = '5'
---
    public function kayit_sil($id){
        $builder = $this->db->table('tanrilar');
        $builder->where('id',$id);
        return $builder->delete();

SELECT *
FROM `tanrilar`
WHERE `id` = '5'
---
    public function kayit_al($id){
        $builder = $this->db->table('tanrilar');
        $builder->where('id',$id);
        $veri=$builder->get()->getResultArray();

UPDATE `tanrilar` SET `baslik` = 'Raddd', `url` = 'raddd', `icerik` = 'Ra, Mısır mitolojisinde güneş tanrısıdır. Kutsal merkezi Heliopolis\'tir. Genellikle başında bir disk bulunan şahin kafalı insan biçiminde canlandırılmıştır. Eski tanrı Atum\'la bir tutularak; IV. sülale döneminde devlet tanrısı olmuştur.\r\n\r\nKefren\'den başlayarak firavunlar, onun soyundan geldiklerini ilan etmişlerdir. Ra daha sonra Osiris firavun ilan edilmiştir. Osiris\'ten sonra ise Set Osirisi öldürerek başa geçmiştir.Set\'en sonra babasının öcünü alarak Horus firavun olmuştur Horus\'u da kapsamış ve Ra-Horakhty (ya da Ra-Horus) ismini almıştır.\r\n\r\nGüneş Ra\'nın sembolüdür; tüm vücudunu ya da gözünü temsil eder. Ra\'nın sembolleri güneş sembolleridir, Phoenix\'e benzer bir özelliği vardır; her sabah ateşlerin içinden tekrar doğar. E.A. Wallis Budge\'a göre; Ra Mısır\'ın tek tanrısı (monoteizm) idi. Diğer tüm tanrılar ve tanrıçalar; Ra\'nın parçalarını oluşturuyordu.\r\n'
WHERE `id` = '5'
---
    public function veri_duzenle($baslik,$url,$icerik,$id){
        $builder = $this->db->table('tanrilar');
        $builder->where('id',$id);

        $data=[
            'baslik'=>$baslik,
            'url'=>$url,
            'icerik'=>$icerik,
        ];

        return $builder->update($data);